<!-- terraform-plan-comment -->
# Terraform Plan Results

**6 change(s):** 3 to create, 3 to update, 0 to replace, 0 to destroy

**⚠️ Resources will be modified**

## Resources to create:
- `databricks_grants.mart_schemas["analytics"]`
- `databricks_group.mart_readers_account["analytics"]`
- `databricks_mws_permission_assignment.mart_readers["analytics"]`

## Resources to update:
- `databricks_grants.catalog_main`
- `databricks_grants.mart_schemas["mban2026"]`
- `databricks_schema.marts["analytics"]`

<details>
<summary>Show diff</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # databricks_grants.catalog_main will be updated in-place
  ~ resource "databricks_grants" "catalog_main" {
        id      = "catalog/goodparty_data_catalog"
        # (1 unchanged attribute hidden)

      + grant {
          + principal  = "mart_analytics_readers"
          + privileges = [
              + "USE_CATALOG",
            ]
        }

        # (17 unchanged blocks hidden)
    }

  # databricks_grants.mart_schemas["analytics"] will be created
  + resource "databricks_grants" "mart_schemas" {
      + id     = (known after apply)
      + schema = "goodparty_data_catalog.mart_analytics"

      + grant {
          + principal  = "a04e9e24-aac3-4308-9a65-d88fa34e444f"
          + privileges = [
              + "SELECT",
              + "USE_SCHEMA",
            ]
        }
      + grant {
          + principal  = "dbt_developers"
          + privileges = [
              + "SELECT",
              + "USE_SCHEMA",
            ]
        }
      + grant {
          + principal  = "ed920c40-3b7d-42cb-ad32-0b4d5484c117"
          + privileges = [
              + "CREATE_TABLE",
              + "MODIFY",
              + "USE_SCHEMA",
            ]
        }
      + grant {
          + principal  = "mart_analytics_readers"
          + privileges = [
              + "SELECT",
              + "USE_SCHEMA",
            ]
        }
    }

  # databricks_grants.mart_schemas["mban2026"] will be updated in-place
  ~ resource "databricks_grants" "mart_schemas" {
        id     = "schema/goodparty_data_catalog.mart_mban2026"
        # (1 unchanged attribute hidden)

      - grant {
          - principal  = "mart_mban2026_readers" -> null
          - privileges = [
              - "SELECT",
              - "USE_SCHEMA",
            ] -> null
        }
      + grant {
          + principal  = "mart_mban2026_readers"
          + privileges = [
              + "CREATE_MODEL",
              + "SELECT",
              + "USE_SCHEMA",
            ]
        }

        # (3 unchanged blocks hidden)
    }

  # databricks_group.mart_readers_account["analytics"] will be created
  + resource "databricks_group" "mart_readers_account" {
      + acl_principal_id           = (known after apply)
      + allow_cluster_create       = false
      + allow_instance_pool_create = false
      + databricks_sql_access      = false
      + display_name               = "mart_analytics_readers"
      + id                         = (known after apply)
      + url                        = (known after apply)
      + workspace_access           = false
      + workspace_consume          = false
    }

  # databricks_mws_permission_assignment.mart_readers["analytics"] will be created
  + resource "databricks_mws_permission_assignment" "mart_readers" {
      + id           = (known after apply)
      + permissions  = [
          + "USER",
        ]
      + principal_id = (known after apply)
      + workspace_id = 3578414625112071
    }

  # databricks_schema.marts["analytics"] will be updated in-place
  ~ resource "databricks_schema" "marts" {
      + comment                        = "Analytics mart for cross-domain business metrics and reporting"
      + force_destroy                  = false
        id                             = "goodparty_data_catalog.mart_analytics"
        name                           = "mart_analytics"
      ~ properties                     = {
          + "managed_by" = "terraform"
          - "owner"      = "root" -> null
          + "purpose"    = "mart"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 3 to add, 3 to change, 0 to destroy.

Changes to Outputs:
  ~ astro_deployments    = {
      ~ dev  = {
            id            = "cml8n1tav1nxs01nd7ptp4tpm"
            name          = "astro-dev"
          ~ webserver_url = "cmgicqn2w002701mqfw3367w2.astronomer.run/dptp4tpm" -> "cml8n1tav1nxs01nd7ptp4tpm.pm.astronomer.run/dptp4tpm"
            # (1 unchanged attribute hidden)
        }
        # (1 unchanged attribute hidden)
    }
  ~ mart_reader_groups   = {
      + analytics = "mart_analytics_readers"
        # (2 unchanged attributes hidden)
    }
```

</details>

---

<details>
<summary>What do these mean?</summary>

- **Create**: New resources will be added
- **Update**: Existing resources will be modified in-place
- **Replace**: Resources will be destroyed and recreated (data loss possible)
- **Destroy**: Resources will be permanently deleted

</details>

---

**To apply these changes:**

1. **Merge** this PR to `main`
2. **Review** the plan in the workflow run triggered by the merge
3. **Deploy** via Actions → Deploy → Run workflow → uncheck "Dry run"

Or via CLI after merge: `gh workflow run deploy.yaml -f dry_run=false`
